InformationRegisters/РегистрацииВНалоговомОргане.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РегистрацииВНалоговомОргане</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПримененияЕНВД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПримененияЕНВД</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РозничнаяТорговляОблагаетсяЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицоНеРезидент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыСкладов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОптовыйСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозничныйМагазин</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/РегистрацииВНалоговомОргане.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>РегистрацииВНалоговомОргане</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Доверенность</Name>
					<Comment>Доверенность налогоплательщика на представителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПредставителя</Name>
					<Comment>Название документа, подтверждающего полномочия представителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦифровойИндексОбособленногоПодразделения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>Код причины постановки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеИФНС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОбособленногоПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представитель</Name>
					<Comment>Представитель в территориальном органе ФНС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УполномоченноеЛицоПредставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Патенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Патенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговыйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПатента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПрименениеПатента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОрганизацииЛокализация/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает таблицу классификатора из макета с предопределенными элементами. Применяется для классификаторов (ОКВЭД,
// ОКОПФ и т.д.) Макеты хранятся в макетах данного справочника (см. общую форму "ФормаВыбораКода").
//	Параметры:
//		НазваниеМакета - Строка - имя макета, хранящего данные с предопределенными элементами классификатора.
//		ТекущийПериод - Дата - в данном методе не используется, однако может быть обязательной в случае обращения к другим классификаторам из общей формы.
//	Возвращаемое значение:
//		Структура - структура параметров со следующими свойствами:
//			* СписокКодов - ТаблицаЗначений - таблица классификатора с колонками:
//				** Код - Строка - строковое представление кода элемента классификатора.
//				** Наименование - Строка - наименование элемента классификатора.
//
Функция ПолучитьПараметрыФормыВыбораДляКода(НазваниеМакета, ТекущийПериод) Экспорт
	Классификатор = Новый ТаблицаЗначений;
	
	Классификатор.Колонки.Добавить("Код");
	Классификатор.Колонки.Добавить("Наименование");
	Классификатор.Индексы.Добавить("Код");
	//++ Локализация
	Макет =Справочники.Организации.ПолучитьМакет(НазваниеМакета);
	
	ТекущаяОбласть = Макет.Области.Найти("Классификатор");
	
	Если НЕ ТекущаяОбласть = Неопределено Тогда
		
		Для НомерСтр = ТекущаяОбласть.Верх По ТекущаяОбласть.Низ Цикл
			
			КодПоказателя	= СокрП(Макет.Область(НомерСтр, 1).Текст);
			Название		= СокрП(Макет.Область(НомерСтр, 2).Текст);
			
			Если КодПоказателя = "###" Тогда
				Прервать;
			ИначеЕсли ПустаяСтрока(КодПоказателя) Тогда
				Продолжить;
			Иначе
				НоваяСтрока = Классификатор.Добавить();
				НоваяСтрока.Код				= КодПоказателя;
				НоваяСтрока.Наименование	= Название;
			КонецЕсли;	
				
		КонецЦикла;
		
	КонецЕсли;
	//-- Локализация
	Параметры = Новый Структура;
	Параметры.Вставить("СписокКодов",	Классификатор);
	
	Возврат Параметры;
	
КонецФункции

// Возвращает соответствие кодов к наименованию, указанное в макете. Применяется для классификаторов (ОКВЭД, ОКОПФ и т.д.).
//
//	Параметры:
//		ИмяМакета - Строка - Имя макета, как оно задано в конфигураторе. Если он не будет обнаружен - будет возвращено пустое соответствие.
//		ИмяОбласти - Строка - Имя анализируемой области макета.
//
//	Возвращаемое значение:
//		ФиксированноеСоответствие - Состоит из:
//			* Ключ - Строка -  код, указанный в первой колонке макета;
//			* Значение - Строка - наименование, указанное во второй колонке макета.
//
Функция СоответствиеКодовКНаименованиюИзМакета(ИмяМакета, ИмяОбласти = "Классификатор") Экспорт
	
	СоответствиеКодов = Новый Соответствие;
	
	Макет = Справочники.Организации.ПолучитьМакет(ИмяМакета);
	Если Макет = Неопределено Тогда
		Возврат Новый ФиксированноеСоответствие(СоответствиеКодов);
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть(ИмяОбласти);
	
	Для Ном = 1 По ОбластьМакета.ВысотаТаблицы Цикл
		
		ТекКод = СокрЛП(ОбластьМакета.Область(Ном,1).Текст);
		ТекНаименование = СокрЛП(ОбластьМакета.Область(Ном, 2).Текст);
		
		Если ТекКод = "###" Тогда
			Прервать;
		ИначеЕсли ПустаяСтрока(ТекКод) Тогда
			Продолжить;
		Иначе
			СоответствиеКодов.Вставить(ТекКод, ТекНаименование);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(СоответствиеКодов);
	
КонецФункции

Процедура ДополнитьСписокРеквизитовОрганизации(Реквизиты) Экспорт
	//++ Локализация
	Реквизиты.Вставить("КПП", "");
	Реквизиты.Вставить("КодПоОКПО", "");
	Реквизиты.Вставить("КодОКВЭД", "");
	Реквизиты.Вставить("СвидетельствоДатаВыдачи", "");
	Реквизиты.Вставить("СвидетельствоСерияНомер", "");
	//-- Локализация
КонецПроцедуры

Процедура ДополнитьРеквизитыОрганизации(Организация, СтруктураРеквизитов, ВыборкаПоОрганизации) Экспорт
	//++ Локализация
	Регистрация = Справочники.РегистрацииВНалоговомОргане.РегистрацияВНалоговомОргане(Организация);
	РеквизитыРегистрации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Регистрация, "КодПоОКТМО, КодПоОКАТО");
	
	СтруктураРеквизитов.Вставить("КодПоОКАТО", "");
	СтруктураРеквизитов.Вставить("КодПоОКТМО", "");
	
	Если ВыборкаПоОрганизации.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
		СтруктураРеквизитов.Свидетельство = НСтр("ru='Свидетельство'")
			+ " "
			+ ВыборкаПоОрганизации.СвидетельствоСерияНомер
			+ " "
			+ НСтр("ru='от'")
			+ " "
			+ Формат(ВыборкаПоОрганизации.СвидетельствоДатаВыдачи, "ДЛФ=D");
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитов,РеквизитыРегистрации);
	//-- Локализация
КонецПроцедуры

// Определяет наличие у организации обособленных подразделений (выделенных на отдельный баланс).
//
// Параметры:
//  Организация - СправочникСсылка.Организации
// 
// Возвращаемое значение:
//  Булево - Истина, если в информационной базе ведется учет
//           обособленных подразделений организации, выделенных на отдельный баланс
//
Функция ЕстьОбособленныеПодразделения(Организация) Экспорт
	
	//++ Локализация
	//-- Локализация
	
	Возврат Ложь;
	
КонецФункции

//++ Локализация

// Возвращает таблицу соответствия числового кода (первых 2 цифр - класса) и буквенного кода раздела ОКВЭД2 
//
// Возвращаемое значение:
//   ТаблицаЗначений - Содержит колонки:
//    * Код - Строка - Первые 2 цифры числового кода из классификатора ОКВЭД2 (класс)
//    * Раздел - Строка - Буквенное обозначение раздела, в который входит указанный класс
//
Функция БуквенныеКодыРазделовОКВЭД2() Экспорт 

	Макет = Справочники.Организации.ПолучитьМакет("ОКВЭД2БуквенныеКодыРазделов");
	Возврат ОбщегоНазначения.ПрочитатьXMLВТаблицу(Макет.ПолучитьТекст()).Данные;

КонецФункции

Процедура ОбновитьНаименованияОКВЭД2() Экспорт
	
	ТаблицаИзменений = ОбщегоНазначения.ПрочитатьXMLВТаблицу(
		Справочники.Организации.ПолучитьМакет("ОКВЭД2ИзмененияНаименований").ПолучитьТекст()).Данные;
	
	ИзмененныеКоды = ТаблицаИзменений.ВыгрузитьКолонку("Код");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИзмененныеКоды", ИзмененныеКоды);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка,
	|	Организации.КодОКВЭД2 КАК КодОКВЭД2,
	|	Организации.НаименованиеОКВЭД2 КАК НаименованиеОКВЭД2
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.КодОКВЭД2 В (&ИзмененныеКоды)";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НаименованиеОКВЭД2 = СокрЛП(Выборка.НаименованиеОКВЭД2);
		
		СтруктураОтбора = Новый Структура("Код", СокрЛП(Выборка.КодОКВЭД2));
		Изменения = ТаблицаИзменений.НайтиСтроки(СтруктураОтбора);
		
		Для каждого Изменение Из Изменения Цикл
			Если НаименованиеОКВЭД2 = Изменение.СтароеНаименование Тогда
				НаименованиеОКВЭД2 = Изменение.НовоеНаименование;
			КонецЕсли;
		КонецЦикла;
		
		Если НаименованиеОКВЭД2 <> СокрЛП(Выборка.НаименованиеОКВЭД2) Тогда
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			Объект.НаименованиеОКВЭД2 = НаименованиеОКВЭД2;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(Объект);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//-- Локализация

#Область ПодключаемыеКоманды

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	//++ Локализация
	
	Отчеты.УчетныеПолитикиОрганизаций.ДобавитьКомандуОтчета(КомандыОтчетов);
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСобытийФормы

// Обработчик события ПриСозданииНаСервере форм элемента справочника Организации.
//
// Параметры:
//  Форма                - ФормаКлиентскогоПриложения - форма, для которой выполняется обработчик.
//  Отказ                - Булево - признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - признак выполнения стандартной (системной) обработки события.
//
Процедура ПриСозданииНаСервереФормаЭлемента(Форма, Отказ, СтандартнаяОбработка) Экспорт
	НастройкиСистемыЛокализация.УстановитьВидимостьЭлементовЛокализации(Форма);
	//++ Локализация
	Объект = Форма.Объект;
	
	Форма.РегистрацияВНалоговомОргане = Объект.РегистрацияВНалоговомОргане;
	
	Форма.КодОрганаПФР                          = Объект.КодОрганаПФР;
	Форма.НаименованиеТерриториальногоОрганаПФР = Объект.НаименованиеТерриториальногоОрганаПФР;
	Форма.РегистрационныйНомерПФР               = Объект.РегистрационныйНомерПФР;
	Форма.ИПРегистрационныйНомерПФР             = Объект.ИПРегистрационныйНомерПФР;
	

	ЗаполнитьОписанияПараметров(Форма);
	УправлениеФормойНаСервере(Форма);
	//-- Локализация
КонецПроцедуры

// Обработчик события ПриЗаписи
// 
// Параметры:
// 	ОбъектЗаписи - СправочникОбъект.Организации - записываемый справочник
// 	Отказ - Булево - Признак отказа
//
Процедура ПриЗаписиОрганизации(ОбъектЗаписи, Отказ) Экспорт 
	//++ Локализация	
	СинхронизироватьНастройкиОбособленныхПодразделений(ОбъектЗаписи, Отказ);
	//-- Локализация
КонецПроцедуры

// Обработчик события ОбработкаЗаполнения
// 
// Параметры:
// 	ОбъектЗаписи - СправочникОбъект.Организации - записываемый справочник
// 	ДанныеЗаполнения - Произвольный - данные заполнения
// 	СтандартнаяОбработка - Булево - признак стандартной обработки
//
Процедура ОбработкаЗаполненияОрганизации(ОбъектЗаписи, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	//++ Локализация
	Если ЗначениеЗаполнено(ДанныеЗаполнения) И Не ДанныеЗаполнения.Свойство("ВалютаРегламентированногоУчета") Тогда
		ОбъектЗаписи.ВалютаРегламентированногоУчета = ЗначениеНастроекПовтИсп.БазоваяВалютаПоУмолчанию();
	КонецЕсли;
	//-- Локализация	
КонецПроцедуры

// Вызывается при создании/чтении формы на сервере
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - форма обработчика
//
Процедура ПриСозданииЧтенииНаСервере(Форма) Экспорт
	//++ Локализация
	
	Форма.НастройкиПодключенияКСервисуИППЗаданы = ПартнерыИКонтрагентыЛокализация.НастройкиПодключенияКСервисуИППЗаданы();
	Форма.ПравоИзмененияОбъекта = ПравоДоступа("Изменение", Метаданные.Справочники.Организации);
	
	ОрганизацииКлиентСерверЛокализация.УправлениеДоступностью(Форма);
	//НастроитьПанельНавигации();	
	//
	//-- Локализация
КонецПроцедуры

// Обработчик события ПередЗаписьюНаСервере
// 
// Параметры:
// 	Отказ - Булево -
// 	ТекущийОбъект - СправочникОбъект.Организации -
// 	ПараметрыЗаписи - Структура -
// 	Форма - ФормаКлиентскогоПриложения -
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи, Форма) Экспорт
	//++ Локализация
	Если Форма.ДанныеРегистрацийВНалоговыхОрганахИзменены Тогда
		ТекущийОбъект.РегистрацияВНалоговомОргане = Форма.РегистрацияВНалоговомОргане;
		ТекущийОбъект.КПП = Форма.РегистрацияВНалоговомОргане.КПП;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.ВалютаРегламентированногоУчета) Тогда
		ТекущийОбъект.ВалютаРегламентированногоУчета = ЗначениеНастроекПовтИсп.БазоваяВалютаПоУмолчанию();
	КонецЕсли;
	//-- Локализация
КонецПроцедуры

// Обработчик события ОбработкаПроверкиЗаполненияНаСервере
// 
// Параметры:
// 	Отказ - Булево - признак отказа.
// 	ПроверяемыеРеквизиты - Массив - массив путей к проверяемым реквизитам.
// 	Форма - ФормаКлиентскогоПриложения - форма обработчика
//
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты, Форма) Экспорт
	//++ Локализация	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ПроверкиВозможностиПримененияПСН(Объект, Отказ);
	
	ПроверяемыйЭлемент = ПроверяемыеРеквизиты.Найти("СтранаРегистрации");
	Если ПроверяемыйЭлемент = Неопределено Тогда
		ПроверяемыеРеквизиты.Добавить("СтранаРегистрации");
	КонецЕсли;
	
	УправлениеПредприятием = НЕ ПолучитьФункциональнуюОпцию("УправлениеТорговлей");
		
	//-- Локализация	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

Процедура УправлениеФормойНаСервере(Форма) Экспорт
	//++ Локализация
	ВидОрганизации =  Форма.ВидОрганизации;
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	ТолькоПросмотр = Форма.ТолькоПросмотр;
	
	Если Форма.ВидОрганизации <> "ОбособленноеПодразделение" Тогда
		Элементы.ГруппаОбщиеНастройкиОтступ.Видимость = Ложь;
	Иначе
		Элементы.ВалютаРегламентированногоУчета.Видимость = Ложь;
	КонецЕсли;
	
	УправлениеПредприятием = НЕ ПолучитьФункциональнуюОпцию("УправлениеТорговлей");

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
				Элементы, 
				"ГруппаОтступКрупнейшийНалогоплательщик",
				"Видимость", 
				УправлениеПредприятием И ВидОрганизации = "ЮридическоеЛицо");
		
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
				Элементы, 
				"КодНалоговогоОрганаПолучателя",
				"Доступность", 
				Объект.КрупнейшийНалогоплательщик);
		
	Если ВидОрганизации = "ОбособленноеПодразделение" Тогда
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСтраницОсновныхКодов",
																		"ТекущаяСтраница", Элементы.ОсновныеКодыОбособленногоПодразделения);
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГоловнаяОрганизация",
																		"ТолькоПросмотр", ЗначениеЗаполнено(Объект.ГоловнаяОрганизация));
	ИначеЕсли ВидОрганизации = "ИндивидуальныйПредприниматель" Тогда
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСтраницОсновныхКодов",
																		"ТекущаяСтраница", Элементы.ОсновныеКодыИндивидуальногоПредпринимателя);
	Иначе
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСтраницОсновныхКодов",
																		"ТекущаяСтраница", Элементы.ОсновныеКодыЮрЛица);
	КонецЕсли;
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, "ГруппаСвидетельствоИП, СвидетельствоСерияНомер, СвидетельствоДатаВыдачи, ДекорацияРегНомерИП, ДекорацияДействуетСИП",
																	"Видимость", (ВидОрганизации = "ИндивидуальныйПредприниматель"));
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, "ДопускаютсяВзаиморасчетыЧерезГоловнуюОрганизацию",
																	"Видимость", (ВидОрганизации = "ОбособленноеПодразделение"));
	
	Если ВидОрганизации = "ЮридическоеЛицо" Тогда
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИНН",
																		"Маска", "9999999999");
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОГРН",
																		"Маска", "9999999999999");
	КонецЕсли;
	
	Если НЕ УправлениеПредприятием Тогда
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
				Элементы, 
				"ПоказатьИсториюИзмененийРегистрацииВНалоговомОргане, ЛокализацияГруппаРегистрационныеДанные, ГруппаТерриториальныеУсловияГрафикРаботыОтступ, ГруппаКадровыйУчетИРасчетЗарплатыОтступ, ГруппаБухучетИВыплатаЗарплатыОтступ, ГруппаВоинскийУчетОтступ, ГруппаРезервыОтпусковОтступ",
				"Видимость", 
				Ложь);
	КонецЕсли;
	
	ДоступностьКнопкиРегистрацииВНалоговомОргане = ПравоДоступа("Изменение", Метаданные.Справочники.РегистрацииВНалоговомОргане);
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, "ГиперссылкаРегистрацияВНалоговыхОрганах",
																	"Доступность", ДоступностьКнопкиРегистрацииВНалоговомОргане);
	ДоступностьИзмененияУчетнойПолитикиИНалогов = 
								ПравоДоступа("Изменение", Метаданные.РегистрыСведений.НастройкиСистемыНалогообложения)
								ИЛИ ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ПримененияЕНВД);
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, "ГруппаУчетнаяПолитикаИДругиеНастройки",
																	"Доступность", ДоступностьИзмененияУчетнойПолитикиИНалогов, Истина);
																	
	
	
	УстановитьСвойстваУчетнойПолитикиИНалогов(Форма);
	
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, 
			"ГруппаПроверки",
			"Доступность", 
			ПравоДоступа("Изменение", Метаданные.Справочники.Организации));
			
	НастроитьТаблицуПримененияЕНВД(Форма);
	НастроитьТаблицуПримененияПСН(Форма);
	
	НеУправленческаяОрганизация = Объект.Ссылка <> Справочники.Организации.УправленческаяОрганизация;
	Элементы.ВидОрганизации.Видимость                          = НеУправленческаяОрганизация;
	Элементы.ГиперссылкаРегистрацияВНалоговыхОрганах.Видимость = НеУправленческаяОрганизация;
	Элементы.ИНН.Видимость                                     = НеУправленческаяОрганизация;
	Элементы.ЗаполнитьПоИНН.Видимость                          = НеУправленческаяОрганизация;
	Элементы.КПП.Видимость                                     = НеУправленческаяОрганизация;
	Элементы.КодОКВЭД.Видимость                                = НеУправленческаяОрганизация;
	Элементы.КодОКВЭД2.Видимость                               = НеУправленческаяОрганизация;
	Элементы.КодПоОКПО.Видимость                               = НеУправленческаяОрганизация;
	Элементы.ОГРН.Видимость                                    = НеУправленческаяОрганизация;
	Элементы.ДатаРегистрации.Видимость                         = НеУправленческаяОрганизация;
	Элементы.ОтступКрупнейшийНалогоплательщик.Видимость        = НеУправленческаяОрганизация;
	Элементы.КрупнейшийНалогоплательщик.Видимость              = НеУправленческаяОрганизация;
	Элементы.КодНалоговогоОрганаПолучателя.Видимость           = НеУправленческаяОрганизация;
	
	ВидимостьКомандПомощникаКопированияНастроек = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") 
												И ПравоДоступа("Редактирование", Метаданные.РегистрыСведений.УчетнаяПолитикаФинансовогоУчета);
												
	Элементы.ЛокализацияГруппаКопированиеНастроек.Видимость = ВидимостьКомандПомощникаКопированияНастроек;
	Элементы.СкопироватьНастройкиУчетаИз.Видимость = ВидимостьКомандПомощникаКопированияНастроек;
	Элементы.СкопироватьНастройкиУчетаВсе.Видимость = ВидимостьКомандПомощникаКопированияНастроек;
	//-- Локализация
КонецПроцедуры

Процедура УчетнаяПолитикаПриИзмененииСервер(Форма) Экспорт
	//++ Локализация
	НастроитьТаблицуПримененияЕНВД(Форма);
	НастроитьТаблицуПримененияПСН(Форма);
	УстановитьСвойстваУчетнойПолитикиИНалогов(Форма);
	//-- Локализация
КонецПроцедуры

Процедура ПриОкончанииИзмененияРеквизита(ИмяЭлемента, Форма, ПараметрыОбработки) Экспорт
	Если ТипЗнч(ИмяЭлемента) = Тип("Массив") Тогда
		Для каждого ТекЭлемент Из ИмяЭлемента Цикл
			ПриОкончанииИзмененияРеквизита(ТекЭлемент, Форма, ПараметрыОбработки);
		КонецЦикла;
	КонецЕсли;
	//++ Локализация
	Если ИмяЭлемента = "ВидОрганизации" Тогда
		ИзменитьВидОрганизацииНаСервере(Форма);
	КонецЕсли;
	Если ИмяЭлемента = "ГоловнаяОрганизация" Тогда
		ЗаполнитьОписаниеДействующихПараметровУчетныхПолитикПриИзмененииГоловнойОрганизации(Форма);
	КонецЕсли;
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

Процедура ВыполнитьКомандуЛокализации(Форма, ИмяКоманды, ПараметрыОбработки) Экспорт
	
	Если ТипЗнч(ИмяКоманды) = Тип("Массив") Тогда
		Для каждого ТекЭлемент Из ИмяКоманды Цикл
			ВыполнитьКомандуЛокализации(Форма, ТекЭлемент, ПараметрыОбработки);
		КонецЦикла;
	КонецЕсли;
	//++ Локализация	
	Если ИмяКоманды = "ЗаполнитьОписаниеРегистрацииВНалоговомОргане"
	Тогда
		ЗаполнитьОписанияПараметров(Форма, ИмяКоманды);
	КонецЕсли;
	Если ИмяКоманды = "ЗаполнитьОписанияПараметров" Тогда
		ЗаполнитьОписанияПараметров(Форма);
	КонецЕсли;
	Если ИмяКоманды = "ВосстановитьДанныеРегистрацийВНалоговыхОрганах" Тогда
		ВосстановитьДанныеРегистрацийВНалоговыхОрганах(Форма);
	КонецЕсли;
	Если ИмяКоманды = "ВосстановитьДанныеРегистрацийВПФР" Тогда
		ВосстановитьДанныеРегистрацийВПФР(Форма);
	КонецЕсли;
	Если ИмяКоманды = "УстановитьСвойстваУчетнойПолитикиИНалогов" Тогда
		УстановитьСвойстваУчетнойПолитикиИНалогов(Форма);
	КонецЕсли;
	Если ИмяКоманды = "НастроитьТаблицуПримененияЕНВД" Тогда
		НастроитьТаблицуПримененияЕНВД(Форма);
	КонецЕсли;
	Если ИмяКоманды = "НастроитьТаблицуПримененияПСН" Тогда
		НастроитьТаблицуПримененияПСН(Форма);
	КонецЕсли;
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиМодуляОбъекта

// Обработчик ПередЗаписью
//
// Параметры:
// 	Объект - СправочникОбъект.Организации - 
// 	Отказ - Булево - 
//
Процедура ПередЗаписью(Объект, Отказ) Экспорт
	
	//++ Локализация
	Если ЗначениеЗаполнено(Объект.РегистрацияВНалоговомОргане) Тогда
		Объект.КодНалоговогоОргана = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РегистрацияВНалоговомОргане, "Код");
	КонецЕсли;
	//-- Локализация
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(ОрганизацияОбъект, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	//++ Локализация
	
	Перем ТекстСообщения;
	
	Если ЗначениеЗаполнено(ОрганизацияОбъект.ОГРН)
	 И Не РегламентированныеДанныеКлиентСервер.ОГРНСоответствуетТребованиям(ОрганизацияОбъект.ОГРН,
		ПартнерыИКонтрагенты.ЭтоЮрЛицо(ОрганизацияОбъект.ЮрФизЛицо),
		ТекстСообщения) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ОрганизацияОбъект, "ОГРН",, Отказ);
		
	КонецЕсли;
	
	ПроверяемыйЭлемент = ПроверяемыеРеквизиты.Найти("ВалютаРегламентированногоУчета");
	Если ПроверяемыйЭлемент <> Неопределено Тогда
		 ПроверяемыеРеквизиты.Удалить(ПроверяемыйЭлемент);
	КонецЕсли;
	
	ПроверяемыйЭлемент = ПроверяемыеРеквизиты.Найти("СтранаРегистрации");
	Если ПроверяемыйЭлемент = Неопределено Тогда
		ПроверяемыеРеквизиты.Добавить("СтранаРегистрации");
	КонецЕсли;
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеСлужебныеМетоды

Процедура УстановитьПараметрыЗапросаПриОбработкеПолученияДанныхВыбора(Параметры, Запрос) Экспорт

	//++ Локализация
	
	
	//-- Локализация
	
КонецПроцедуры

Процедура ДополнитьСоответствиеЭлементовФормыПараметрамНалоговУчетныхПолитик(СоответствиеЭлементов) Экспорт
	
	МассивЭлементов = Новый Массив();
	МассивЭлементов.Добавить("ГруппаНастройкиСистемыНалогообложенияОтступ");
	МассивЭлементов.Добавить("ОтступНастройкиСистемыНалогообложения");
	МассивЭлементов.Добавить("ГруппаНастройкиСистемыНалогообложения");
	МассивЭлементов.Добавить("ОписаниеНастройкиСистемыНалогообложения");
	МассивЭлементов.Добавить("ОткрытьНастройкиСистемыНалогообложения");

	СтруктураЭлементов = Новый Структура();
	СтруктураЭлементов.Вставить("МассивЭлементов", МассивЭлементов);
	СтруктураЭлементов.Вставить("ЭлементОписание", "ОписаниеНастройкиСистемыНалогообложения");
		
	СоответствиеЭлементов.Вставить("НастройкиСистемыНалогообложения", СтруктураЭлементов);
	
	МассивЭлементов = Новый Массив();
	МассивЭлементов.Добавить("ГруппаУчетнаяПолитикаБухУчетаОтступ");
	МассивЭлементов.Добавить("ОтступУчетнаяПолитикаБухУчета");
	МассивЭлементов.Добавить("ГруппаУчетнаяПолитикаБухУчета");
	МассивЭлементов.Добавить("ОписаниеУчетнаяПолитикаБухУчета");
	МассивЭлементов.Добавить("ОткрытьУчетнаяПолитикаБухУчета");
	
	СтруктураЭлементов = Новый Структура();
	СтруктураЭлементов.Вставить("МассивЭлементов", МассивЭлементов);
	СтруктураЭлементов.Вставить("ЭлементОписание", "ОписаниеУчетнаяПолитикаБухУчета");
	
	СоответствиеЭлементов.Вставить("УчетнаяПолитикаБухУчета", СтруктураЭлементов);

	МассивЭлементов = Новый Массив();
	МассивЭлементов.Добавить("ГруппаНастройкиУчетаНалогаНаПрибыльОтступ");
	МассивЭлементов.Добавить("ОтступНастройкиУчетаНалогаНаПрибыль");
	МассивЭлементов.Добавить("ГруппаНастройкиУчетаНалогаНаПрибыль");
	МассивЭлементов.Добавить("ОписаниеНастройкиУчетаНалогаНаПрибыль");
	МассивЭлементов.Добавить("ОткрытьНастройкиУчетаНалогаНаПрибыль");
	
	СтруктураЭлементов = Новый Структура();
	СтруктураЭлементов.Вставить("МассивЭлементов", МассивЭлементов);
	СтруктураЭлементов.Вставить("ЭлементОписание", "ОписаниеНастройкиУчетаНалогаНаПрибыль");
		
	СоответствиеЭлементов.Вставить("НастройкиУчетаНалогаНаПрибыль", СтруктураЭлементов);

	МассивЭлементов = Новый Массив();
	МассивЭлементов.Добавить("ГруппаНастройкиУчетаУСНОтступ");
	МассивЭлементов.Добавить("ОтступНастройкиУчетаУСН");
	МассивЭлементов.Добавить("ГруппаНастройкиУчетаУСН");
	МассивЭлементов.Добавить("ОписаниеНастройкиУчетаУСН");
	МассивЭлементов.Добавить("ОткрытьНастройкиУчетаУСН");

	СтруктураЭлементов = Новый Структура();
	СтруктураЭлементов.Вставить("МассивЭлементов", МассивЭлементов);
	СтруктураЭлементов.Вставить("ЭлементОписание", "ОписаниеНастройкиУчетаУСН");
		
	СоответствиеЭлементов.Вставить("НастройкиУчетаУСН", СтруктураЭлементов);
	
	МассивЭлементов = Новый Массив();
	МассивЭлементов.Добавить("ГруппаИмущественныеНалогиОтступ");
	МассивЭлементов.Добавить("ОтступИмущественныеНалоги");
	МассивЭлементов.Добавить("ГруппаИмущественныеНалоги");
	МассивЭлементов.Добавить("ОписаниеСтавкиНалогаНаИмущество");
	МассивЭлементов.Добавить("ОткрытьСтавкаНалогаНаИмущество");
	МассивЭлементов.Добавить("ГруппаОсновныеСредства");
	МассивЭлементов.Добавить("ДекорацияСтавкаНалогаНаИмуществоОсновныеСредства");
	МассивЭлементов.Добавить("УстановитьПорядокУплатыНалоговНаМестах");
	
	СтруктураЭлементов = Новый Структура();
	СтруктураЭлементов.Вставить("МассивЭлементов", МассивЭлементов);
	СтруктураЭлементов.Вставить("ЭлементОписание", "ОписаниеСтавкиНалогаНаИмущество");
	
	СоответствиеЭлементов.Вставить("СтавкиНалогаНаИмущество", СтруктураЭлементов);
	
КонецПроцедуры

Процедура ЗаполнитьОписаниеДействующихПараметровУчетныхПолитикПриИзмененииГоловнойОрганизации(Форма, ИмяРегистра = "") Экспорт
	СоответствиеЭлементов = Справочники.Организации.СоответствиеЭлементовФормыПараметрамНалоговУчетныхПолитик();
	НастройкиНалоговУчетныхПолитик.УправлениеВидимостьюЭлементовУчетныхПолитик(Форма, СоответствиеЭлементов, Форма.Объект.ГоловнаяОрганизация);
	НастройкиНалоговУчетныхПолитик.ЗаполнитьОписаниеДействующихПараметров(Форма, Форма.Объект.ГоловнаяОрганизация, ИмяРегистра);
	ОрганизацииЛокализация.УчетнаяПолитикаПриИзмененииСервер(Форма);
КонецПроцедуры

//++ Локализация

Функция ИзменитьИНН(СсылкаНаОбъект) Экспорт
	ИНН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, "ИНН");
	Возврат ИНН
КонецФункции

Функция РегистрацииВНалоговыхОрганахВХранилище(ОбъектСсылка, УникальныйИдентификатор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РегистрацииВНалоговомОргане.Подразделение,
	|	РегистрацииВНалоговомОргане.Организация,
	|	РегистрацииВНалоговомОргане.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	РегистрСведений.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
	|ГДЕ
	|	РегистрацииВНалоговомОргане.Организация = &Организация
	|;
	|";
	
	Запрос.УстановитьПараметр("Организация", ОбъектСсылка);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Регистрации = Новый Структура();
	
	Регистрации.Вставить("РегистрацииВНалоговомОргане",                     Результат[0].Выгрузить());
	
	
	РегистрацииСохраненныеЗначения = ПоместитьВоВременноеХранилище(Регистрации, УникальныйИдентификатор);
	Возврат РегистрацииСохраненныеЗначения
	
КонецФункции
//-- Локализация

Функция ВозможнаРегистрацияДляОбособленныхПодразделений() Экспорт
	//++ Локализация
	Возврат Справочники.РегистрацииВНалоговомОргане.ВозможнаРегистрацияДляОбособленныхПодразделений();
	//-- Локализация
	Возврат Ложь
КонецФункции


#КонецОбласти

#КонецОбласти

//++ Локализация

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСобытийЭлементовШапкиФормы_Служебные

Процедура ИзменитьВидОрганизацииНаСервере(Форма)
	Объект = Форма.Объект;
	Если Форма.ВидОрганизации = "ЮридическоеЛицо" Тогда
		Объект.СвидетельствоДатаВыдачи = Неопределено;
		Объект.СвидетельствоСерияНомер = "";
	ИначеЕсли Форма.ВидОрганизации = "ИндивидуальныйПредприниматель" Тогда
		Объект.ИНН = "";
		Объект.КПП = "";
	ИначеЕсли Форма.ВидОрганизации = "ОбособленноеПодразделение" Тогда
		Объект.СвидетельствоДатаВыдачи = Неопределено;
		Объект.СвидетельствоСерияНомер = "";
	Иначе
		ВызватьИсключение Нстр("ru = 'Произошла ошибка при изменении типа организации. Обратитесь к администратору.'");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

Процедура НастроитьТаблицуПримененияЕНВД(Форма)
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРозничныеПродажи")
		И Форма.ВидОрганизации <> "ОбособленноеПодразделение" Тогда
	
		Если НЕ ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПримененияЕНВД) Тогда
			Форма.Элементы.ГруппаОтступПрименениеЕНВД.Видимость = Ложь;
		ИначеЕсли НЕ ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ПримененияЕНВД) Тогда
			Форма.Элементы.ГруппаОтступПрименениеЕНВД.Доступность = Ложь;
			ОбновитьСсылкуПримененияЕНВД(Форма);
		Иначе
			ОбновитьСсылкуПримененияЕНВД(Форма);
		КонецЕсли;

	Иначе
		Форма.Элементы.ГруппаОтступПрименениеЕНВД.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

Процедура ОбновитьСсылкуПримененияЕНВД(Форма)
	ЕстьПравоНаИзменение = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ПримененияЕНВД);
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Склады.Ссылка), 0) КАК КоличествоСкладов,
	|	СУММА(ВЫБОР
	|		КОГДА ПримененияЕНВД.РозничнаяТорговляОблагаетсяЕНВД = ИСТИНА ТОГДА
	|			1
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ) КАК КоличествоСкладовЕНВД
	|ИЗ
	|	Справочник.Склады КАК Склады
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПримененияЕНВД.СрезПоследних(&ТекущаяДата, Организация = &ГоловнаяОрганизация) КАК ПримененияЕНВД
	|		ПО Склады.Ссылка = ПримененияЕНВД.Склад
	|ГДЕ
	|	Склады.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.РозничныйМагазин)");
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", Форма.ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЕстьПравоНаИзменение Тогда
			ТекстоваяСтрока = НСтр("ru ='Настроить применение ЕНВД (%КоличествоСкладовЕНВД% из %КоличествоСкладов%)'");
		Иначе
			ТекстоваяСтрока = НСтр("ru ='Просмотреть применение ЕНВД (%КоличествоСкладов%)'");
		КонецЕсли;
		ТекстоваяСтрока = СтрЗаменить(ТекстоваяСтрока, "%КоличествоСкладов%", Выборка.КоличествоСкладов);
		ТекстоваяСтрока = СтрЗаменить(ТекстоваяСтрока, "%КоличествоСкладовЕНВД%", Выборка.КоличествоСкладовЕНВД);
		Форма.СтрокаЕНВД = Новый ФорматированнаяСтрока(ТекстоваяСтрока, , , , "НастроитьТаблицуПримененияЕНВД");
	Иначе
		Форма.СтрокаЕНВД = Новый ФорматированнаяСтрока(НСтр("ru='Нет информации о применении ЕНВД.'"));
	КонецЕсли;
КонецПроцедуры

Процедура НастроитьТаблицуПримененияПСН(Форма)
	
	Организация = Форма.Объект.Ссылка;
		
	Если Форма.ВидОрганизации = "ИндивидуальныйПредприниматель"
		И НастройкиНалоговУчетныхПолитикЛокализация.ОрганизацияПрименяетПатенты(Организация) Тогда
		
		СписокПатентовОрганизации = Справочники.Патенты.ПолучитьПатентыПоОрганизации(Организация, Неопределено);
		СписокДействующихПатентовОрганизации = Справочники.Патенты.ПолучитьДействующиеПатентыНаДату(Организация, Неопределено);
		СтрокаПСН = СтрШаблон(НСтр("ru='Патенты (%1 из %2)'"), СписокДействующихПатентовОрганизации.Количество(), СписокПатентовОрганизации.Количество());
		Форма.СтрокаПСН = Новый ФорматированнаяСтрока(СтрокаПСН, , , , "НастроитьТаблицуПримененияПСН");
		
	Иначе
		Форма.СтрокаПСН = Новый ФорматированнаяСтрока(НСтр("ru='Нет информации о применении ПСН.'"));
	КонецЕсли;
	
КонецПроцедуры


Процедура СинхронизироватьНастройкиОбособленныхПодразделений(ОбъектЗаписи, Отказ)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОбособленныеПодразделенияВыделенныеНаБаланс") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.ОбособленноеПодразделение
		|	И Организации.ГоловнаяОрганизация = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка", ОбъектЗаписи.Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			ЗаблокироватьДанныеДляРедактирования(Выборка.Ссылка);
		Исключение
			
			ТекстОшибки = НСтр("ru='Не удалось заблокировать %Элемент%. %ОписаниеОшибки%'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Элемент%",        Выборка.Ссылка);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ОписаниеОшибки%", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
			
		КонецПопытки;
			
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.ИНН = ОбъектЗаписи.ИНН;
		Объект.ЮрФизЛицо = ОбъектЗаписи.ЮрФизЛицо;
		Объект.КрупнейшийНалогоплательщик = ОбъектЗаписи.КрупнейшийНалогоплательщик;
		Объект.КодНалоговогоОрганаПолучателя = ОбъектЗаписи.КодНалоговогоОрганаПолучателя;
		
		Попытка
			
			Объект.Записать();
			
		Исключение
			
			ТекстОшибки = НСтр("ru='Не удалось записать %Элемент%. %ОписаниеОшибки%'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Элемент%",        Выборка.Ссылка);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ОписаниеОшибки%", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
			
		КонецПопытки
		
	КонецЦикла;
	
	Если ОбъектЗаписи.ОбособленноеПодразделение Тогда
		
		// Синхронизация настроек ЕНВД
		
		НастройкиГоловнойОрганизации = РегистрыСведений.ПримененияЕНВД.СоздатьНаборЗаписей();
		НастройкиГоловнойОрганизации.Отбор.Организация.Установить(ОбъектЗаписи.ГоловнаяОрганизация);
		НастройкиГоловнойОрганизации.Прочитать();
		
		НастройкиОбособленногоПодразделения = НастройкиГоловнойОрганизации;
		НастройкиОбособленногоПодразделения.Отбор.Организация.Установить(ОбъектЗаписи.Ссылка);
		Для Каждого НастройкаОбособленногоПодразделения Из НастройкиОбособленногоПодразделения Цикл
			НастройкаОбособленногоПодразделения.Организация = ОбъектЗаписи.Ссылка;
		КонецЦикла;
		
		Попытка
			
			НастройкиОбособленногоПодразделения.ДополнительныеСвойства.Вставить("СинхронизацияНастроек", Истина);
			НастройкиОбособленногоПодразделения.Записать();
			
		Исключение
			
			ТекстОшибки = НСтр("ru='Не удалось изменить настройки применения ЕНВД. %ОписаниеОшибки%'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ОписаниеОшибки%", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
			
			Возврат;
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВосстановитьДанныеРегистрацийВНалоговыхОрганах(Форма)
	
	Регистрации = ПолучитьИзВременногоХранилища(Форма.РегистрацииСохраненныеЗначения);
	
	НаборЗаписей = РегистрыСведений.РегистрацииВНалоговомОргане.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Форма.Объект.Ссылка);
	
	Для Каждого Строка Из Регистрации.РегистрацииВНалоговомОргане Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Строка);
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	Форма.Объект.РегистрацияВНалоговомОргане = Справочники.РегистрацииВНалоговомОргане.РегистрацияВНалоговомОргане(Форма.Объект.Ссылка);
	Форма.РегистрацияВНалоговомОргане = Форма.Объект.РегистрацияВНалоговомОргане;
	ЗаполнитьОписанияПараметров(Форма, "ЗаполнитьОписаниеРегистрацииВНалоговомОргане");
КонецПроцедуры

Процедура ВосстановитьДанныеРегистрацийВПФР(Форма)
	
	
	Возврат; // в УТ11 не используется
	
КонецПроцедуры


Процедура УстановитьСвойстваУчетнойПолитикиИНалогов(Форма)
	Элементы = Форма.Элементы;
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьРеглУчет") Тогда
		Элементы.ГруппаИмущественныеНалогиОтступ.Видимость = Ложь;
		Элементы.ДекорацияСтавкаНалогаНаИмуществоОсновныеСредства.Видимость = Ложь;
		Элементы.УстановитьПорядокУплатыНалоговНаМестах.Видимость = Ложь;
	КонецЕсли;
	
	ДействующиеНалоги = НастройкиНалоговУчетныхПолитик.ДействующиеПараметрыНалоговУчетныхПолитик(
		"НастройкиСистемыНалогообложения",
		Форма.Объект.Ссылка);
	ПрименяетсяЕНВД = Ложь;
	ПрименяетсяПСН = Ложь;
	Если ЗначениеЗаполнено(ДействующиеНалоги) Тогда
		ПрименяетсяЕНВД = ДействующиеНалоги.ПрименяетсяЕНВД;
		ПрименяетсяПСН = ДействующиеНалоги.ПрименяетсяПСН;
	КонецЕсли;
	Элементы.ГруппаПеременнойДоступности.Доступность  		  = (Форма.ВидОрганизации <> "ОбособленноеПодразделение");
	Элементы.ЛокализацияГруппаКопированиеНастроек.Доступность = (Форма.ВидОрганизации <> "ОбособленноеПодразделение");
	Элементы.ДекорацияПредупреждениеЕНВД.Видимость 	  		  = (Форма.ВидОрганизации = "ОбособленноеПодразделение") И ПрименяетсяЕНВД;
	Элементы.ДекорацияПредупреждениеУчетнаяПолитика.Видимость = (Форма.ВидОрганизации = "ОбособленноеПодразделение");
	Элементы.ГруппаОтступПрименениеЕНВД.Видимость 	  		  = ПрименяетсяЕНВД;
	Элементы.ГруппаОтступПрименениеПСН.Видимость              = (Форма.ВидОрганизации = "ИндивидуальныйПредприниматель") И ПрименяетсяПСН;
	

КонецПроцедуры

#Область ЗаполнениеОписаний

Процедура ЗаполнитьОписанияПараметров(Форма, ИмяОписания = "")
	
	ЗаполнитьОписаниеРегистрацииВНалоговомОргане(Форма);
	
КонецПроцедуры


//
//	Параметры:
//		ОбъектЗаписи - СправочникОбъект.Организации
//
Процедура ПроверкиВозможностиПримененияПСН(ОбъектЗаписи, Отказ)
	
	Если Не ОбъектЗаписи.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель")
		И УчетнаяПолитика.ПрименяетсяПСН(ОбъектЗаписи.Ссылка, ТекущаяДатаСеанса()) Тогда
			ТекстОшибки = НСтр("ru = 'В учетной политике установлено использование ПСН. Применение патента доступно только для индивидуальных предпринимателей.'");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,,Отказ);
			
			Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОписаниеРегистрацииВНалоговомОргане(Форма, ИмяОписания = "", ЗаполнятьДанныеРегистрацииНО = Ложь)
	
	Если ЗначениеЗаполнено(ИмяОписания)
		И ИмяОписания <> "ЗаполнитьОписаниеРегистрацииВНалоговомОргане" Тогда
		
		Возврат
		
	КонецЕсли;
	
	ПравоЧтения = ПравоДоступа("Чтение", Метаданные.Справочники.РегистрацииВНалоговомОргане);
	
	КоличествоНалоговыхОрганов = 0;
	
	Если ПравоЧтения Тогда
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Регистрация.РегистрацияВНалоговомОргане) КАК КоличествоНалоговыхОрганов
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОбособленныеПодразделения.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
		|	ИЗ
		|		РегистрСведений.РегистрацииВНалоговомОргане КАК ОбособленныеПодразделения
		|	ГДЕ
		|		ОбособленныеПодразделения.Организация = &Организация
		|		И ОбособленныеПодразделения.РегистрацияВНалоговомОргане <> &РегистрацияВНалоговомОргане
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		Организации.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
		|	ИЗ
		|		Справочник.Организации КАК Организации
		|	ГДЕ
		|		Организации.ОбособленноеПодразделение
		|		И Организации.ГоловнаяОрганизация = &Организация
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РегистрацииВНалоговомОргане.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
		|	ИЗ
		|		РегистрСведений.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
		|	ГДЕ
		|		РегистрацииВНалоговомОргане.Организация.ОбособленноеПодразделение
		|		И РегистрацииВНалоговомОргане.Организация.ГоловнаяОрганизация = &Организация
		|		И РегистрацииВНалоговомОргане.РегистрацияВНалоговомОргане <> &РегистрацияВНалоговомОргане
		|
		|	) КАК Регистрация");
		
		Запрос.УстановитьПараметр("Организация", Форма.Объект.Ссылка);
		Запрос.УстановитьПараметр("РегистрацияВНалоговомОргане", Форма.РегистрацияВНалоговомОргане);
		
		УстановитьПривилегированныйРежим(Истина);
		Выборка = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);
		Если Выборка.Следующий() Тогда
			КоличествоНалоговыхОрганов = Выборка.КоличествоНалоговыхОрганов;
		Иначе
			КоличествоНалоговыхОрганов = 0;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Форма.РегистрацияВНалоговомОргане) Тогда
		
		ОписаниеРегистрацииВНалоговыхОрганах = НСтр("ru = 'Организация состоит на учете в налоговом органе:'")
			+ " %РегистрацияВНалоговомОргане%.";
		ОписаниеРегистрацииВНалоговыхОрганах = СтрЗаменить(
			ОписаниеРегистрацииВНалоговыхОрганах,
			"%РегистрацияВНалоговомОргане%",
			Форма.РегистрацияВНалоговомОргане);
		
		Если ЗаполнятьДанныеРегистрацииНО Тогда
			РеквизитыНО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Форма.РегистрацияВНалоговомОргане, "Код, НаименованиеИФНС");
			Форма.Объект.КодНалоговогоОргана 			= РеквизитыНО.Код;
			Форма.Объект.НаименованиеНалоговогоОргана = РеквизитыНО.НаименованиеИФНС;
		КонецЕсли;
		
	Иначе
		
		ОписаниеРегистрацииВНалоговыхОрганах = НСтр("ru = 'Организация не состоит на учете в налоговом органе.'");
		
		Если ЗаполнятьДанныеРегистрацииНО Тогда
			Форма.Объект.КодНалоговогоОргана 			= "";
			Форма.Объект.НаименованиеНалоговогоОргана = "";
		КонецЕсли;
		
	КонецЕсли;
	
	Если КоличествоНалоговыхОрганов > 0 Тогда
		ОписаниеРегистрацииВНалоговыхОрганах = ОписаниеРегистрацииВНалоговыхОрганах
			+ " " + НСтр("ru = 'Обособленные подразделения состоят на учете в'") + " %КоличествоНалоговыхОрганов% ";
		ОписаниеРегистрацииВНалоговыхОрганах = СтрЗаменить(
			ОписаниеРегистрацииВНалоговыхОрганах,
			"%КоличествоНалоговыхОрганов%",
			Формат(КоличествоНалоговыхОрганов,"ЧГ=0"));
		Если КоличествоНалоговыхОрганов <> 11 И Прав(Строка(КоличествоНалоговыхОрганов), 1) = "1" Тогда
			ОписаниеРегистрацииВНалоговыхОрганах = ОписаниеРегистрацииВНалоговыхОрганах + НСтр("ru = 'налоговом органе.'");
		Иначе
			ОписаниеРегистрацииВНалоговыхОрганах = ОписаниеРегистрацииВНалоговыхОрганах + НСтр("ru = 'налоговых органах.'");
		КонецЕсли;
	КонецЕсли;
	
	Форма.Элементы.ГиперссылкаРегистрацияВНалоговыхОрганах.РасширеннаяПодсказка.Заголовок = ОписаниеРегистрацииВНалоговыхОрганах;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

//-- Локализация
